name: "mini_vgg"

layers {
  name: "data"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: false
    mean_value: 127.5
    mean_value: 127.5
    mean_value: 127.5
    #scale: 0.0078125
  }
  image_data_param {
    root_folder: "/Users/camlin_z/Data/data/"
    source: "/Users/camlin_z/Data/data/label_train.txt"
    shuffle: true
    batch_size: 64
    new_height: 224
    new_width:  224
    rate_height: 0.1
    rate_width:  0.1
  }
}
layers {
  name: "data"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    mean_value: 127.5
    mean_value: 127.5
    mean_value: 127.5
    scale: 0.0078125
 }
  image_data_param {
  root_folder: "/Users/camlin_z/Data/data/"
  source: "/Users/camlin_z/Data/data/label_val.txt"
  shuffle: false
  batch_size: 10
  new_height: 224
  new_width:  224
  rate_height: 0.1
  rate_width:  0.1
  }
}

layers {
  bottom: "data"
  top: "conv1"
  name: "conv1"
  type: CONVOLUTION
  convolution_param {
    num_output: 96
    kernel_size: 3
    stride: 2
	weight_filler{
		type: "xavier"
	}
	bias_filler{
		type: "constant"
		value: 0.1
	}
  }

}
layers {
  bottom: "conv1"
  top: "conv1b"
  name: "conv1b"
  type: CONVOLUTION
  convolution_param {
    num_output: 96
    kernel_size: 3
    stride: 3
	weight_filler{
		type: "xavier"
	}
	bias_filler{
		type: "constant"
		value: 0.1
	}
  }

}
layers {
  bottom: "conv1b"
  top: "conv1b"
  name: "relu1"
  type: RELU
}
layers {
  bottom: "conv1b"
  top: "norm1"
  name: "norm1"
  type: LRN
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}

layers {
  bottom: "norm1"
  top: "conv2"
  name: "conv2"
  type: CONVOLUTION
  convolution_param {
    num_output: 256
    kernel_size: 3
	stride: 1
	weight_filler{
		type: "xavier"
	}
	bias_filler{
		type: "constant"
		value: 0.1
	}
  }
}
layers {
  bottom: "conv2"
  top: "conv2b"
  name: "conv2b"
  type: CONVOLUTION
  convolution_param {
    num_output: 256
    kernel_size: 3
	stride: 3
	weight_filler{
		type: "xavier"
	}
	bias_filler{
		type: "constant"
		value: 0.1
	}
  }
}
layers {
  bottom: "conv2b"
  top: "conv2b"
  name: "relu2"
  type: RELU
}

layers {
  bottom: "conv2b"
  top: "conv3"
  name: "conv3"
  type: CONVOLUTION
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
	stride: 1
	weight_filler{
		type: "xavier"
	}
	bias_filler{
		type: "constant"
		value: 0.1
	}
  }
}
layers {
  bottom: "conv3"
  top: "conv3"
  name: "relu3"
  type: RELU
}
layers {
  bottom: "conv3"
  top: "conv4"
  name: "conv4"
  type: CONVOLUTION
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3

	weight_filler{
		type: "xavier"
	}
	bias_filler{
		type: "constant"
		value: 0.1
	}
  }
}
layers {
  bottom: "conv4"
  top: "conv4"
  name: "relu4"
  type: RELU
}
layers {
  bottom: "conv4"
  top: "conv5"
  name: "conv5"
  type: CONVOLUTION
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
	stride: 2

	weight_filler{
		type: "xavier"
	}
	bias_filler{
		type: "constant"
		value: 0.1
	}
  }
}
layers {
  bottom: "conv5"
  top: "conv5"
  name: "relu5"
  type: RELU
}

layers {
  bottom: "conv5"
  top: "fc7"
  name: "fc7"
  type: INNER_PRODUCT
  inner_product_param {
    num_output: 2048

	weight_filler{
		type: "xavier"
	}
	bias_filler{
		type: "constant"
		value: 0.1
	}
  }
}
layers {
  bottom: "fc7"
  top: "fc7"
  name: "relu7"
  type: RELU
}
layers {
  bottom: "fc7"
  top: "fc7"
  name: "drop7"
  type: DROPOUT
  dropout_param {
    dropout_ratio: 0.5
  }
}

layers {
  bottom: "fc7"
  top: "68point"
  name: "68point"
  type: INNER_PRODUCT
  inner_product_param {
    num_output: 136
	weight_filler{
		type: "xavier"
	}
	bias_filler{
		type: "constant"
		value: 0.1
	}
  }
}
layers {
  name: "loss"
  type: EUCLIDEAN_LOSS
  bottom: "68point"
  bottom: "label"
  top: "loss"
  #loss_weight: 0
}
